// DojoClockv1_31

// NOTES: MUST "UPLOAD" css file (found in data folder) to firmware via littlefile system.
// NOTES: morenvsflash.csv with "board_build.partitions = morenvsflash.csv" in platformio.ini allocates upper non-standard portions of NVS survives reboots but not flash!!
// So... After Flash, preferences and programs will most likely need to be reentered.
//================================
// PROBLEM: (FIXED!) Fight bells single, wait, double is confusing.
// PROBLEM: (FIXED!): Use Light sensor results in black display
// PROBLEM: (FIXED!): Dark mode can go as low as 3 (of 255) and appears off, when it's not.
// PROBLEM: Add a cool random LED "wake up Effect" in the slowTimer myCycle routine??? WHY! No one's going to be there at sunrise! Out Darkness? "Lights on" maybe?
//================================

// DECLARATIONS
#include <Arduino.h>
//#include "esp_heap_caps.h" //Memory measurements

// ========== No web interface > Values Stored in Preferences ================
// Changed in the LCD setup and saved on change.
bool worldTime = 0;
bool useDST = 1;
char timeZone = 'C'; // E- Eastern, C- Central, M- Mountain, W-Western
uint8_t DSTStartSunday = 2;  // Second Sunday in March 2am Begin
uint8_t DSTStartMonth = 3;  // Second Sunday in March 2am Begin
uint8_t DSTEndSunday = 1; // First Sunday in November 2am End
uint8_t DSTEndMonth = 11; // First Sunday in November 2am End

#include <Preferences.h>
Preferences eeprom; // Global Preferences object for NVS access
// Structure to hold 'prefs' data
struct PrefsData {
    String ssid;
    String password;
    uint8_t colorClock; // 13
    uint8_t colorSeconds; // 4
    uint8_t colorMonth; // 8
    uint8_t colorDate; // 3
    uint8_t taskHour; // 3 , 24 hour time HOUR to sync clock
    uint8_t taskMinute; // 0 , 24 hour time MINUTE to sync clock
    uint8_t luxDeltaCovered; // 50 ,  % decline to indicate a sensor cover.
    int8_t  brightnessLateral; // 0 , + larger shifts line Left, - larger shifts line right. Y intercept of the slope! 
    uint8_t brightnessMax; // 255
    uint8_t brightnessMin; // 3 , 1 isn't really visible
    uint8_t brightnessStatic; // 50 , fastLED master: 1-255 8 bit, initial value used with NO light sensor
    uint8_t brightnessMinDark; // 15, In dark mode this is the minimum value brightness.
    uint8_t blendSpeed; // 40 , LED blend value 0-255 40 = ~2 seconds.
    uint8_t bellStrikeTime; // 18 , ms of relay engaging, 14ms is the quietest
    uint8_t neglectTime; // 120 , Minutes to return to clock mode
    uint8_t lcdBacklightTime; // 120 , Seconds to turn off LCD Backlight.
    uint8_t luxDarkMode; // 10, Sensor Lux value to go to dark mode.
    uint8_t nightDisplayOffTime; // 22, 10PM 
    bool    useBeeper;
    bool    useBell;
    bool    useLightSensor; // 1, If sensor fails, can be used to go forward.
    bool    nightDisplayOff; // 1, from 10pm to 6pm if dark, shut off LED display.
    float   brightnessSlope; // 0.25 , Larger numbers steepen the line, smaller decrease steepenes. 0.51 is rougly 45 deg angle intial value. 
    float   luxStabilityVariance; // 1.75 , % difference the samples need to be within to be "Stable."
} prefsData;

// Programs 0-9 each with 30 lines with CMD and DAT
// Define the number of character and byte elements per namespace
// With 60 elements total, it will be 30 pairs of char/byte
const int NUM_PAIR_ELEMENTS = 30;
const int TOTAL_NAMESPACE_ELEMENTS = NUM_PAIR_ELEMENTS * 2; // Should be 60

// Structure to hold data for each numbered namespace (programs 0-9)
struct NamespaceData {
    String title;
    char charElements[NUM_PAIR_ELEMENTS]; // Stores char values
